Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཁྲོས་པས་དྲངས་ནས་ཁྲོ་བོའི་རྒྱལ་པོའི་བཟླས་བརྗོད་བགྱིས་ན། དེ་ནས་རྣམ་ཐོས་མཆིས་ནས། ཉིན་གཅིག་བཞིན་དོང་ཙེ་སྟོང་སྩོལ་བར་འགྱུར། གསེར་སྟོང་སྩོལ་བར་འགྱུར་ཏེ།
en: If the vidyā holder ties the noose around the neck of Vaiśravaṇa and pulls him angrily while reciting the mantra of the lord of wrath, Vaiśravaṇa will come every day to offer one thousand dinars and one thousand pieces of gold.

source: དེས་ཉིན་གཅིག་བཞིན་སྦྱིན་པ་ཡང་སྩོལ། བསོད་ནམས་ཀྱང་བགྱིའོ།
en: The vidyā holder should give it away every day as gifts, thus accumulating merit. “

source: །ནག་པོ་ཆེན་པོའི་མགུལ་དུ་བཏགས་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་བརྗོད་བགྱིས་ཏེ། ཁྲོས་པས་ལག་པ་གཡས་པའི་ཐལ་ལྕག་གིས་བརྡེག་པར་བགྱིའོ།
en: The vidyā holder should tie the noose around the neck of Mahākāla and recite the Krodharāja seven times while holding the noose with his right hand and slapping Mahākāla angrily.

source: །ནག་པོ་ཆེན་པོས་སྒྲ་ཕྱུང་བ་དང་། རིག་སྔགས་འཆང་སྐྲག་པར་མི་བགྱི་བར་སླར་ཡང་ཁྲོས་པས་བརྡེག་པར་བགྱིའོ།
en: The vidyā holder should not be afraid when Mahākāla shrieks, but instead angrily threaten him further.

source: །དེ་ནས་མཆི་མ་ཟགས་པ་དང་།
en: When Mahākāla starts shedding tears, the vidyā holder should collect a tear and apply it to his forehead as a bindi.

source: རིག་སྔགས་འཆང་གིས་མ་བཟེད་དེ། ཐིག་ལེ་བགྱིས་ན་མི་གདའ་བར་གྱུར་ནས་གཏེར་ཐམས་ཅད་མཐོང་བར་འགྱུར་རོ།
en: When he does so, he will become invisible and will be able to see all hidden treasures.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་སླར་ཡང་ཐལ་མོས་བརྡེག་པར་བགྱིས་ཏེ། དེ་ནས་ནག་པོ་ཆེན་པོ་ཁྲག་ཏུ་སྐྱུགས་པ།
en: He should slap Mahākāla again, causing him to vomit blood.

source: རིག་སྔགས་འཆང་གིས་བྱུགས་ན་ནམ་མཁའ་ལ་མཆིས་ནས། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོར་འགྱུར་རོ།
en: If the vidyā holder touches it, he will fly up into the sky and become the great lord of the yakṣas. “

source: །གུ་གུལ་གྱི་བདུག་པས་བདུགས་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་ན། ནག་པོ་ཆེན་པོ་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་ནས་ཅི་འཚལ་བའི་མཆོག་ཐམས་ཅད་སྩོལ་བར་བགྱིད་ཅིང་།
en: If the vidyā holder offers bdellium incense while mindfully repeating the Krodharāja mantra, Mahākāla will come before him in his true form and grant him every boon he desires.

source: མ་མོའི་ཚོགས་དང་བཅས་པ་ཐམས་ཅད་དབང་དུ་མཆི་བར་འགྱུར་རོ། །གཞན་ཡང་ཅི་འཚལ་བ་བགྱིད་པ་པ་དགོས་པ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: His host of mātṛs will remain in the vidyā holder’s thrall, and he will perform all the tasks that need to be performed or that the vidyā holder wants performed. “

source: །མདུང་རྩེ་གསུམ་པའི་ཞགས་པ་བསྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This was the practice procedure of the trident noose. “

source: དེ་ནས་གཞན་ཡང་ཞགས་པ་དང་རྗེས་སུ་མཐུན་པའི་རི་མོའི་ཆོ་ག་དེ་ཁོ་ན་ཉིད་སྒྲུབ་པའི་ཆོ་ག་བླ་ན་མེད་པ་བརྗོད་པར་བགྱི་སྟེ།
en: Now I will explain how to use the painting when performing the noose practice. It is an unsurpassable method for mastering reality. “

source: འཇིག་རྟེན་མགོན་པོས་སྣ་ཚོགས་པའི། །རྣམ་པའི་ཁ་དོག་གཟུགས་བསྟན་པ། །སྒྱུ་མ་ལྟ་བུའི་ཏིང་འཛིན་གྱིས། །ཆོ་འཕྲུལ་སྣ་ཚོགས་གཟུགས་བསྟན་ཏེ།
en: The Lord of the World displays A variety of forms and appearances; Using the illusion-like samādhi, He displays diverse magical forms. “

source: །ལག་པ་སྟོང་དང་མིག་སྟོང་དང་། །མཐའ་ཡས་པ་ཡི་ཕྱག་རྒྱ་བསྟན།
en: With a thousand hands and a thousand eyes, He displays an infinite number of mudrās.

source: །རྣམ་པ་སྣ་ཚོགས་པ་ཡི་གཟུགས། །ཁམས་གསུམ་དག་ཏུ་བསྟན་པ་ནི།
en: These various implements and forms Appear throughout the triple world. “

source: །གདུལ་བྱ་གདུལ་ཕྱིར་གཟུགས་བསྟན་ཏོ། །གསང་བ་འདི་ཡི་གཟུགས་བསྟན་པ། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །རིག་སྔགས་སྒྲུབ་པ་བླ་ན་མེད།
en: By displaying his most secret forms, He guides those to be guided with such displays.

source: །དེ་ཉིད་ཞགས་པ་བསྒྲུབས་ཕྱིར་རོ།
en: This practice of the noose Is meant to embrace all beings with compassion. “

source: །དེ་བས་རིག་འཛིན་ཤེས་རབ་ཅན། །འཇིག་རྟེན་ཕ་རོལ་རྗེས་མཐུན་པ།
en: It truly brings the inner accomplishment of the vidyā.

source: །སངས་རྒྱས་ཉིད་དོན་གཉེར་བ་དང་། །དེ་བཞིན་གཤེགས་ཀུན་ལྟ་བ་དང་། །བདེ་ཅན་བལྟ་བར་འཚལ་བ་དང་། །དེ་ཉིད་འཇིག་རྟེན་འདས་པ་ཡི། །འཇིག་དབང་མགོན་པོ་མཐོང་འཚལ་བ། །མཆོག་ཏུ་གུས་པར་བགྱི་བ་ཡི། །ཆོ་གའི་རྒྱལ་པོ་འདི་བརྗོད་ཀྱིས།
en: Therefore, a wise vidyā holder Who strives for higher birth And the goal of buddhahood, “Who wants to see the realm of Sukhāvatī With all its tathāgatas, Who wants to see the lord Lokeśvara— The true savior of the world— “Should put all his trust In this sovereign ritual.

source: །དེ་ཉིད་གུས་པར་དང་བ་དང་། །ཤིན་ཏུ་དང་བ་ཉིད་དུ་བགྱི།
en: He should have faith, respect, And a benevolent frame of mind. “

source: །གྲོལ་བ་སྣ་ཚོགས་འཚལ་བ་ལ། །སྣ་ཚོགས་པ་ཡི་གཟུགས་བསྟན་ཏེ། །སྣ་ཚོགས་ཐབས་ཀྱིས་གྲོལ་བར་འགྱུར་རོ།
en: Different forms are displayed And different methods taught For those who desire different types of liberation.

source: །དོན་ཡོད་རྒྱལ་པོ་ཆོ་གའི་མཆོག །དོན་ཡོད་གྲུབ་པའི་འཇིག་རྟེན་འདས།
en: This sovereign amogha ritual is supreme. “

source: །དོན་ཡོད་འབྲས་བུ་དམ་པ་པོ། །དོན་ཡོད་ཀུན་དུ་གྲུབ་པ་འཐོབ།
en: It leads to amogha accomplishment And brings supreme amogha results.

source: །སངས་རྒྱས་ཀུན་གྱིས་བྱིན་གྱིས་བརླབས། །དོན་ཡོད་འཇིག་རྟེན་འཇིག་རྟེན་མགོན།
en: It brings the supramundane amogha accomplishment That is empowered by all the buddhas. “

source: །འཇིག་རྟེན་དབང་ཕྱུག་མཆོད་སྦྱིན་པ།
en: This amogha ritual of the Lord of the World Grants power and boons to the world.

source: །དོན་ཡོད་འཇིག་རྟེན་ཅི་འཚལ་བ། །མཆོག་འཚལ་བ་ནི་གྲུབ་པར་འགྱུར།
en: It grants worldly amogha accomplishments And the desired boons to those who seek them. “

source: །དོན་ཡོད་རྒྱ་ཆེན་རྫུ་འཕྲུལ་གྱི། །ཆོ་འཕྲུལ་རྣམ་འཕྲུལ་རྒྱུན་མི་འཆད།
en: Combining miraculous displays, It possesses vast magical powers.

source: །དེ་ལྟ་བས་ན་ཀུན་བསྒྲིམས་ཏེ། །བདག་ཉིད་ཡོངས་སུ་དག་བགྱིས་ནས།
en: The vidyā holder should therefore Make every effort to purify himself. “

source: །ཇི་ལྟར་ཆོ་ག་བཀོད་པ་བཞིན། །རྗེས་སུ་མཐུན་པར་རི་མོའི་གཟུགས། །རྟག་ཏུ་རི་མོའི་གཟུགས་བལྟ་ཞིང་།
en: He should perform the rite according to the procedure Required for the cloth painting And recite the mantra While continually gazing at the painting. “The Lord of the World, the granter of boons, Can take many forms.

source: །ཞགས་པའི་གཟུགས་ནི་སྣ་ཚོགས་དང་། །དེ་བཞིན་ཁྲོ་བོའི་རྒྱལ་པོ་དང་།
en: He is the deity of the various forms of the noose, And likewise he is Krodharāja. “

source: །རིག་སྔགས་རྒྱལ་པོ་དེ་བཞིན་དུ།
en: He is the king of vidyās and the deity of the maṇḍala.

source: །དཀྱིལ་འཁོར་ལྷ་དང་མེ་ལྷ་དང་།
en: He is the god of fire and the burnt offering.

source: །སྦྱིན་སྲེག་རླུང་ལྷ་ཆུ་ལྷ་དང་།
en: He is Vāyu and he is Varuṇa.

source: །ཁྲོ་བོའི་གཟུགས་དང་ཞི་བ་དང་།
en: He can assume a wrathful or a peaceful form. “

source: །ལྷ་དང་ཀླུ་དང་སྟོན་པ་དང་། །གནོད་སྦྱིན་སྲིན་པོའི་གཟུགས་དང་ནི། །འབྱུང་པོ་ལྷ་མིན་དྲི་ཟ་དང་། །ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི། །ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་ཀུན་དུ། །འཇིག་རྟེན་མགོན་པོ་མཆོག་སྦྱིན་བསྟན།
en: He can appear as deity, As a nāga, yakṣa, rākṣasa, Bhūta, asura, gandharva, Garuḍa, kinnara, or mahoraga. “

source: །གཤིན་རྗེ་དང་ནི་ལུས་ངན་དང་། །ཚངས་པ་ཁྱབ་འཇུག་དབང་ཕྱུག་ཆེ། །གཞོན་ནུ་དབང་ཕྱུག་ལྷ་དང་ནི། །དབང་ཕྱུག་ཆེན་པོ་ཉི་མ་དང་།
en: He can be Yama, Kubera, Brahmā, Viṣṇu, Maheśvara, Kumāra, The god Īśvara, or Maheśvara.

source: །ཟླ་གཟུགས་རྒྱུ་སྐར་ཚེས་གྲངས་ལྷ། །འདི་དག་རྣམ་པ་སྣ་ཚོགས་པའི།
en: He can assume the peaceful form of Āditya, “Or the deities of the lunar asterisms and lunar days.

source: །གཟུགས་སུ་འཇིག་རྟེན་མགོན་པོས་བསྟན། །སེམས་ཅན་རྣམས་ལ་ཕན་འཚལ་བས།
en: Desiring to benefit beings, The Lord of the World appears In all these different forms. “

source: །གདུལ་བའི་དོན་དུ་གྲོལ་བའི་ལམ། །སེམས་ཅན་རྣམས་ལ་བསྟན་པས་ན།
en: He does this to guide them And to show them the path to liberation.

source: །དེ་བས་སོམ་ཉི་ཉིད་མི་བགྱི། །མཆོག་ཏུ་དང་བར་བགྱི་བ་ལགས། །ཅི་ལྟར་མཐུན་པའི་དགོས་པ་རྣམས། །ཅི་ལྟར་མཐུན་པ་བཞིན་དུ་འགྲུབ། །ཅི་ལྟར་མཐུན་པ་རི་མོའི་གཟུགས།
en: One should have no doubts about this.

source: །ཅི་ལྟར་མཐུན་པའི་ཞགས་པ་སྒྲུབ། །གནས་འདི་གང་དུ་འོས་པ་དང་། །གང་དུ་སེམས་ནི་དགའ་བར་འགྱུར། །གོམས་པ་གང་གི་ཕྱག་རྒྱ་དང་། །གང་གི་དཀྱིལ་འཁོར་ཆར་དབྱེ་བ།
en: Whatever the ritual procedure, “Whatever the vidyā holder’s practice, Whatever the cotton painting, Whatever the noose practice, Whatever the place of worship, “Whatever it is that thrills his mind, Whatever the mudrā that he displays, Whatever the divisions in the maṇḍala, Noble Avalokiteśvara is present in all of them. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་མགོན། །ཀུན་དུ་སྒྲོལ་བ་འདྲེན་པའི་གཙོ།
en: He is there as the protector, The savior, the guide, and the teacher.

source: །དོན་ཡོད་འབྲས་བུ་སྩོལ་བའོ།
en: He bestows the amogha accomplishment And grants the amogha results. “

source: །དོན་ཡོད་པ་ཡི་གྲུབ་པ་ཐོབ། །དོན་ཡོད་དགོས་པ་ཐམས་ཅད་དང་། །གྲུབ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ནི། །མཆོག་ཉིད་ལ་ཡང་རེག་པར་འགྱུར།
en: The vidyā holder will accomplish All requisite performance without fail And attain the level of the Sage Who turns the supreme Dharma wheel. “

source: །ཞགས་པ་དང་རི་མོ་བསྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This pertains to the practice procedures of the noose that involve the painting. “

source: དེ་ནས་དོན་ཡོད་པའི་ལས་དང་དགོས་པ་སྒྲུབ་པ་ཐམས་ཅད་ཀྱི་སྦྱིན་སྲེག་གི་ཆོ་ག་བཤད་པར་བྱ་སྟེ།
en: Now I will teach a homa procedure that accomplishes the aims of all amogha activities.

source: སྡིག་པ་ཐམས་ཅད་མོད་ལ་འཕྲོག་པ།
en: It instantly removes every evil and destroys all obstacles.

source: སྒྲིབ་པ་ཐམས་ཅད་འཇིག་པར་བགྱིད་པ། དགྲ་ཐམས་ཅད་འཇོམས་པ། བགེགས་ཐམས་ཅད་རྣམ་པར་འཇོམས་པ།
en: It crushes all enemies, destroys all vighnas, and repels all wicked beings.

source: གདུག་བ་ཐམས་ཅད་བཟློག་པའི་མཆོག་སྡིག་པ་ཐམས་ཅད་འཇིག་པར་བགྱིད་པ།
en: It is the best way to eradicate any vice.

source: དམྱལ་བའི་སྡུག་བསྔལ་བཅུ་དྲུག་ལས་གྲོལ་བར་བགྱིད་པ།
en: It saves from the sufferings of the sixteen hells.

source: འཇིགས་པ་མི་བཟད་པ་བརྒྱད་རྟག་ཏུ་འཕྲོག་པ།
en: It continuously removes the eight unbearable fears.

source: མི་མཛའ་བ་རྣམས་འཇོམས་པ། ཕ་རོལ་གྱི་དཔུང་ལྡོག་པའི་མཆོག །
en: It obliterates adversaries and is the best means for repelling foreign armies.

source: ནད་ཐམས་ཅད་འཇོམས་པ། མོད་ལ་འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཞི་བར་བགྱིད་པ། མུ་གེའི་དགོན་པ་འཇིག་པར་བགྱིད་པ།
en: It instantly removes all diseases and pacifies every argument, quarrel, and dispute.

source: ཡམས་ཀྱི་ནད་དང་གནོད་པ་འཇོམས་པ།
en: It prevents famines and other misfortunes and calamities, and it attracts divine pleasures and happiness. “

source: ལྷའི་བདེ་བ་འདྲེན་པར་བགྱིད་པའི་མཆོག་དེ་ཁོ་ན་ཉིད་ཀྱི་སངས་རྒྱས་སྒྲུབ་པ།
en: The homa rite can truly accomplish buddhahood.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་བླ་ན་མེད་པའི་མཆོག་ཐམས་ཅད་སྒྲུབ་པར་བགྱིད་པ།
en: It is the best means to effect every accomplishment, including the supreme awakening of the Buddha.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐུན་མོང་མཆོག་སྦྱིན་ཤིན་ཏུ་རྙེད་པར་དཀའ་བ་ལྷ་རྣམས་རྟག་ཏུ་མགུ་བར་འགྱུར་བ།
en: It is accessible to all beings, granting them the best of boons that are difficult to obtain.

source: ཀླུ་རྣམས་དགའ་བ་འཐོབ་པར་འགྱུར་བ།
en: It always pleases the deities and brings joy to the nāgas.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་རྟག་ཏུ་ཉིན་མཚན་དུ་གཟིགས་པར་སོམ་ཉི་མ་མཆིས་པ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགའ་བར་འགྱུར་བ།
en: The tathāgatas will, without a doubt, watch over the vidyā holder day and night, and the bodhisattvas will rejoice.

source: དུས་ཀུན་དུ་ཤིན་ཏུ་མཉམ་པར་བཞག་པས།
en: The vidyā holder, constantly focused, will always receive boons from the Lokeśvara; there is no doubt about this.

source: འཇིག་རྟེན་དབང་ཕྱུག་མཆོག་སྦྱིན་རྟག་ཏུ་མཆིས་པར་སོམ་ཉི་མ་མཆིས་པར་རྒྱལ་པོ་ཆེན་པོ་བཞི་འཁོར་དང་བཅས་བློན་པོ་དང་བཅས་པ་བསྲུང་བའི་དོན་དུ་ཐམས་ཅད་དུ་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་ལགས་སོ།
en: The Four Great Kings together with their retinues and ministers will always look after him, affording him every kind of protection. “

source: །དེ་ནས་རིག་སྔགས་འཆང་ཤེས་རབ་དང་ལྡན་པས།
en: A wise vidyā holder should therefore perform the homa.

source: གཙང་མའི་གནས་སུ་མཆིས་ནས་སྦྱིན་སྲེག་བགྱི་སྟེ། གཙང་མ་ཡི་ནི་ས་ཕྱོགས་སམ། །ཅ་ཅོ་མ་མཆིས་དབེན་པར་ནི། །ཞི་བ་དང་ནི་རྒྱས་པ་དང་། །དྲག་ཤུལ་སྤྱོད་པ་རྣམས་བགྱིའོ།
en: He should go to a place that is clean, choose an area on the ground that is clean and well concealed, and perform the activities of pacifying, nourishing, or assaulting, all while free from distraction.

source: །ཞི་བ་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །དོན་དུ་སྡིག་པ་ཐམས་ཅད་འཇོམས། །རྒྱས་པ་རྒྱས་པ་ཐོབ་འགྱུར་ཏེ།
en: Pacifying should be performed for the sake of all beings to remove all their negativity.

source: །ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་འགྱུར།
en: Through the rites of nourishing, the vidyā holder will obtain complete well-being without any deficiencies.

source: །དགྲ་དང་ལོག་འདྲེན་གདུག་པ་དང་། །གནོད་སྦྱིན་སྲིན་པོ་གསང་བ་པ། །གདུག་སེམས་ཅན་རྣམས་བྲེད་པ་དང་། །སྐྲག་པར་སྡིགས་པ་དྲག་ཤུལ་སྤྱོད།
en: If the vidyā holder is afraid of enemies or vināyakas, or wicked yakṣas, rākṣasas, and guhyakas, he should perform the rite of assault with a wrathful mind in order to frighten and tame them.

source: །གསང་སྔགས་སྒྲུབ་པའི་སྦྱིན་སྲེག་སྟེ། །གསང་སྔགས་སྒྲུབ་པ་བླ་ན་མེད།
en: This homa is an unsurpassable means to accomplish the mantra.

source: །འཇིག་རྟེན་འཇིག་རྟེན་ཕ་རོལ་གྱི།
en: It is performed for worldly aims, as well as those that relate to the hereafter.

source: །སྦྱིན་སྲེག་གི་ནི་ལས་བགྱིའོ། །མེ་ལྷའི་ལྷ་དང་ཀླུ་དག་དང་། །དེ་བཞིན་རིག་པ་འཛིན་པའང་དགུག །
en: It can be used to summon the god of fire, devas, nāgas, and vidyādharas. “

source: ཁུང་བརྐོས་དེ་ལ་པདྨའི་ཚུལ། །པདྨ་རྟག་ཏུ་བྲི་བར་བགྱི།
en: The vidyā holder should dig a pit shaped like a lotus and draw a lotus there as always, with filaments in the center.

source: །ཆོ་ག་ཅི་བཞིན་ཁུང་ནང་གི། །པདྨ་ལ་ནི་གེ་སར་བགྱི། །གྲུ་བཞིའམ་ནི་ཟླུམ་པོ་སྟེ།
en: The pit should be dug according to procedure as a square or circular pit.

source: །དེ་ལྟ་བུ་ནི་བརྐོ་བར་བགྱི། །ལེགས་པར་བྱུགས་ཤིང་ཤིན་ཏུ་གནག །ཤིན་ཏུ་སྦས་ཤིང་ཚད་ལ་དབབ།
en: It should be carefully wiped, completely white, well concealed, well proportioned, and perfect.

source: །ཚེས་གྲངས་རྒྱུ་སྐར་ཉིད་དག་དང་། །ཤིན་ཏུ་བཀྲ་ཤིས་དག་ལ་བགྱི།
en: The day and the stars should be auspicious.

source: །བཀྲ་ཤིས་ཕྱག་རྒྱ་ཆེན་པོ་སྟེ། །བཟང་པོས་གཏོར་མའི་ལས་བགྱིའོ། །བདུག་པ་མེ་ཏོག་ལ་སོགས་པ། །བཟང་པོ་དག་ནི་འཁོར་བར་དགོད།
en: He should make an extensive bali offering with fine articles and place divine incense and flowers all around. “

source: །ཐོག་མར་མེ་ལྷ་བཀུག་ནས་ནི། །དེ་ནས་སྦྱིན་སྲེག་ལས་རྣམས་བགྱི། །རིག་སྔགས་འཆང་བ་གཙང་གྱུར་པ།
en: He should first summon the god of fire and thereafter perform the homa rite.

source: །ལེགས་བཀྲུས་གཙང་མའི་གོས་བགོས་ནས། །གསང་སྔགས་བཟླས་པའི་ཆོ་ག་བགྱི། །དེ་ལ་མཚམས་ཀྱང་བཅིང་བར་བགྱི། །བདག་བསྲུང་གཙུག་ཏོར་བཅིང་བ་དང་། །གཞན་བསྲུང་དཀྱིལ་འཁོར་བཅིང་བ་དང་། །དེ་བཞིན་གྲོགས་བགྱིད་བསྲུང་བ་དང་།
en: Then, ritually pure, bathed, and wearing clean clothes, he should recite the mantras according to the procedures necessary for the setting of the boundaries, performing self-protection, tying his hair in a topknot, establishing the sacred area for the protection of others, and creating protection for his assistants.

source: །རྒྱུན་དུ་ཨརྐའི་ཤིང་སྤར་ཏེ། །དྲི་ཡི་ཤིང་རྣམས་ཉིད་དག་དང་། །མར་དང་ཡུངས་ཀར་འབྲས་ཡོས་དག །
en: For fuel, he should always use sticks of giant milkweed and fragrant wood.

source: ཉི་ཤུ་གཅིག་དབུལ་མེ་སྟོན་བགྱི། །དེ་ནས་མེའི་ལྷ་དགུག་གོ། །ཨོཾ་ན་མོ྅་གྣི་ཛྭ་ལ། མ་ཧཱ་ཛྭ་ལ། ཛྱོད་སྣཱ་པྲ་བྷཱ་མཎྜལ།
en: He should cast ghee, mustard seeds, and parched grains twenty-one times for the fire to consume, and he should summon the god of fire with the mantra: [166] “Oṁ, I salute you, O blazing fire, blazing brightly with large flames and a halo of light.

source: སརྦ་བིད་ཨཱཧུ་ཏི་རཀྟི་ནི་རཏ་ཏུཥྞ་ཛྭ་ལ།
en: You are the omniscient fire of sacrificial oblations, burning hot with smoke and hissing sounds; the flames are your face.

source: དྷུ་མ་ཤྭ་ས།
en: As hot and bright as a forest fire or lightning, your main function is to consume oblations.

source: ཨརྩི་ཥཱ་མུ་ཁ་ཏྲིཥྞ།
en: You are the great energy, the great victory, the great power, and the destructive ability of all gods and yakṣas.

source: རཤྨི་ད་བ་ཨག་ནིཤྩ་བིད་ཏུ་ཏཤྩ་ཧཱུ་ཏ་ཤ་ན་མུ་ཁ་ན་ཏེ།
en: Burning everything, you freely expand through space in cloud-like swirls.

source: སརྦ་དེ་བཱ་ནཱཾ།
en: You are universally worshiped and honored as a fearless form of the divine.

source: སརྦ་ཡཀྵ་མ་ཧཱ་བཱིརྱ་མ་ཧཱ་ཛ་ཡ།
en: You are a bringer of winds and the oblation-eating god, Hutāśana.

source: མ་ཧཱ་བཱ་ལ།
en: When there is darkness, you dispel it by radiating light.

source: ནིར་མ་རི་ཤན།
en: You have the fragrance of beautyberry and are born from the tastes of the best of fruits and food.

source: སརྦ་ད་ཧཱ་ན་པྲ་བུ་ལ་ཨཱ་ཀཱ་ཤ་ས་མུག་གང་ཀཤྩ་ཨ་བ་པྲས་ད་ཀཱ་ཤན།
en: Beloved, you are subtle, very sharp, and a reviver of the dead.

source: མན་ཌ་ལ་པཱུ་ཛི་ཏོ།
en: Ashes for flowers and ashes for clothing, ashes are useful—they are always used to cover.

source: མ་ཎི་ཏ་སརྦ་ཏྲ་དི་བ་བྱ་རུ་པ།
en: You arise within the billows of smoke.

source: བི་ཤཱ་ར་དང་།
en: Accomplished in cooking, you bring out the best of flavors.

source: ཨཱ་བཱ་ཧཱ་ན་སརྦ་ད་ཏྲ་གཱན།
en: You run everywhere, wiping out everything.

source: དེ་བ་ཧཱུ་ཏ།
en: Once you touch and sting, you don’t want to let go.

source: ཤ་ན་ཧུ་ཏྲ།
en: Among the gods of the thirty-two abodes, you are the chief god of fire.

source: ཤ་ན་ཏ་མ་སི་བི་དྷ་མ་ཀ་ན།
en: You give vitality and strength to those without appetite.

source: ཨན་དྷ་ཀཱ་རཱ་ན།
en: You are a great fire priest, the fearless god of gods, always the most noble.

source: མུག་ཏེ་རཤྨི་མ་པྲི་ཡང་ཀུ་གྷ་ན་དྷ་ཕ་ལཱ་ཧ་ར།
en: Swiftly make the rites truly successful!

source: ས་ར་ས་ར། ཨ་གྲ་ཛ། སཱུཀྵྨ་སུ་ཏཱིཀྵྞཤྩ་མྲྀ་ཏི་ས་ན་ཙི་བི་ན། པྲི་ཡོ་པཤྨི་པུཤྨི་པུཤྤ་བྷ་སྨ་བྷསྟ་ཙ་བྷ་སྨ་བསྟྲ་ནི།
en: Oṁ, burn, burn!

source: སེ་བ་ཀྃ །བྷ་སྨ་སཉྩ་དྷ་ནིད་ཏྱན་དྷུ་མ་མཱ་ཀུ་ལ། ཛཱ་ཡ་སེ་པཱ་ཀ་སིད་དྷ་རས་གྲཱ་ཙ་ར་ས་རྦད་ཏྲ་པྲ་དྷ་པ་རི་ཤཱ།
en: Remain!

source: ས་རྦད་ཏྲ་ནི་ར་མ་རི་ཤ་ཎོ། ནིར་ཏྱ་སྤྲིཥྚ་དྷཤྚ་ན་མུཉྩ་སི། དྭ་ཏྲིང་ཤ །བྷ་བ་ནོ་དེ་བ་ཨག་ནི་མུ་ཁ་དེ་བཱ་ཏ། ཨེ་རུ་ཙི་རུ་ཛཱ་བ་ལ་བ་ད་ཀ་མ་ཧཱ་ན་ཏ། ཨ་ཐ་པར་ཎོ། དེ་བ་དེ་བ་ན། བི་ཤཱ་ར་ད། ཨ་ཡཱ་ན་ཏུ་སཱ་དྷ་ཤི་གྷྲཾ་ཀར་མ་སཱ་དྷ་ཡ་ཏད་ཏྭ་ཏ།
en: Huru, huru the samaya!

source: ཨོཾ་ཛྭ་ལ་ཛྭ་ལ། ཏིཥྛ་ས་མ་ཡན། ཧུ་རུ་ཧུ་རུ་ཧཱུྃ་ཕཊ་སྭཱ་ཧཱ།
en: Hūṁ phaṭ, svāhā! “

source: གསང་སྔགས་འདིས་ནི་ལན་བདུན་དུ། །བཟླས་ནས་མེ་ནི་དགུག་པར་བགྱི། །གུ་གུལ་ཡུངས་ཀར་མར་སྦྱར་ལ། །སྤར་བདུན་སྤར་བས་མེ་ལ་དབུལ།
en: The vidyā holder should magnify Agni with this mantra, repeating it seven times while offering seven handfuls of bdellium and mustard seeds smeared with ghee into the fire.

source: །མཆོད་ཡོན་སྣོད་རྣམས་དབུལ་བ་ཡང་།
en: A welcome offering of argha water for the feet should be offered by hand.

source: །དེ་བཞིན་སྤར་བའི་སྤར་བས་སོ། །དྲི་རྣམས་དང་ནི་བྱུག་པ་དང་། །བདུག་པ་རྒྱ་ཆེར་དབུལ་བར་བགྱི། །དེ་བཞིན་འབྲས་བུ་སྤར་བར་འབུལ།
en: The skilled vidyā holder should also offer perfume, scented oils, incense, and a handful of fruits.

source: །དེ་ནས་ཆབ་ཀྱིས་བསང་བ་བགྱི། །ཅི་ལྟར་ལྷ་རྣམས་རིམ་བཞིན་དུ། །ཉེ་རེག་དག་ཀྱང་དབུལ་བར་བགྱི། །དེ་ནས་རིག་སྔགས་འཆང་གིས་སུ།
en: He should then sprinkle himself with water.

source: །སྦྱིན་སྲེག་ལས་ནི་ཡང་དག་བརྩམ། །དྲི་ཞིམ་ཤིན་ཏུ་དག་པ་དང་། །བླག་ཤ་ཨུ་དུམ་བཱ་ར་དང་། །སྣ་མའི་མེ་ཏོག་ཙམ་པ་དང་།
en: Following the prescribed order for the specific deity rite, he should take a sip of the water and commence the homa ritual, using clean sticks of fragrant wood from bodhi tree, cluster fig, great flowering jasmine, champak, or karnikara.

source: །ཀར་ནི་ཀ་ར་ཉིད་དག་དང་། །པདྨ་ཨུཏྤལ་ཐང་ཤིང་དང་། །དེ་བཞིན་དྲི་བདའི་ཙནྡན་དང་།
en: One may also use white and blue lotuses, cedar, surabhi, and sandalwood. “

source: །བྱང་ཆུབ་ལྗོན་ཤིང་ཤིང་དག་དང་། །དེ་བཞིན་གཞན་ཡང་དྲི་བདའི་ཤིང་། །འོན་ཏེ་འབྲས་བུའི་ཤིང་མང་དང་། །ཤ་མི་ཤི་བའི་ལས་ལགས་པས། །མཆོད་ཡོན་དེ་བཞིན་རྩྭ་དག་སྟེ།
en: For the rites of pacifying, a skilled vidyā holder, peacefully disposed, should use sticks of bodhi tree, or other fragrant sticks or slats of wood, and the darbha grass of the best quality.

source: །དེ་དག་གིས་ནི་མེ་སྤར་ནས། །སྦྱིན་སྲེག་གི་ནི་ལས་རྣམས་བགྱིའོ། །འབྲས་ཡོས་ཙནྡན་ཕྱེ་མ་དང་། །ཨ་གུ་རུ་དང་དུ་རུ་སྐ། །ཀུན་དུ་རུ་ལ་སོགས་པ་དང་།
en: Having lit the fire with them, he should continue with the homa ritual, using parched rice, sandalwood powder, agarwood, olibanum or frankincense, fenugreek, spikenard, and beautyberry.

source: །དུ་རུ་སྐར་བཅས་སྤྲི་ཀ་དང་། །སྤང་སྤོས་པྲི་ཡང་ཀུ་བླངས་ཏེ། །དེ་དག་ལྷན་ཅིག་སྦྱར་བསྲེས་ཤིང་། །མར་རམ་མར་སར་ལྷན་ཅིག་བརྫི།
en: He should mix these ingredients together, adding ghee and freshly churned butter to the mixture.

source: །དོན་ཡོད་རྒྱལ་པོའི་གསང་སྔགས་ནི། །བརྒྱ་རྩ་བརྒྱད་བཟླས་མེ་ལ་དབུལ།
en: He should recite the mantra of Amogharāja one hundred and eight times and offer the mixture to the fire.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་ལན་སྟོང་རྩ་བརྒྱད་ཀྱི་སྦྱིན་སྲེག་བགྱིའོ།
en: He should offer it as one thousand and eight oblations in front of the painting of Noble Avalokiteśvara. “

source: །ལན་སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་། ནམ་ཕྱེད་ན་མེ་ལྷ་རང་གི་གཟུགས་འབར་བར་ཤིན་ཏུ་གནས་པ་ལགས་ནས་ཕྱོགས་བཅུར་བལྟ་ཞིང་ཀུན་དུ་བརྟགས་ནས། རིག་སྔགས་འཆང་ལ་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་འགྱུར་ཏེ།
en: When the vidyā holder has thus reached the number one thousand and eight, the god of fire will appear in person at midnight. Blazing steadily, he will look in the ten directions, examine everything, and applaud the vidyā holder: ‘Good!

source: །བདག་ཚིམ་པར་བྱས་པས་རིག་སྔགས་འཆང་ཁྱོད་ཀྱིས་སྦྱིན་སྲེག་གི་ཆོ་ག་གྲུབ་ཀྱིས་མཆོག་སློངས་ཤིག་དང་།
en: I am pleased that you, the vidyā holder, have successfully performed the supreme homa procedure.

source: ཐམས་ཅད་སྦྱིན་ནོ།
en: I will give you everything you ask for.’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཅི་ལྟ་བུའི་འདོད་པའི་མཆོག་རྣམས་བླང་བར་བགྱི་སྟེ། ཅི་ལྟར་བླངས་པ་བཞིན་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: The vidyā holder should request whatever boons he desires, and he will be given whatever he requests.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་མཆོད་ཡོན་གྱི་སྣོད་དག་འབུལ་ཞིང་གཏོར་མ་དབུལ་བའི་ལས་བགྱིའོ།
en: The vidyā holder should then offer argha water for the feet and make a ritual bali offering. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་མར་དང་བསྲེས་པའི་གོང་བུ་ཆེན་པོ་དག་གིས་སྦྱིན་སྲེག་བགྱི་ཞིང་། འབྲས་བུའི་ཤིང་སྤར་ནས། དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ། །སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་།
en: Next, he should offer a large sacrificial cake smeared with ghee into the fire while feeding the fire with sticks of a fruit tree and reciting the heart mantra of Amogharāja one thousand and eight times.

source: ཐབ་ཀྱི་དབུས་ནས་སྐྱེས་པ་ཞིག་ལུས་ཕྱེད་ཙམ་ཕྱུང་ནས། དངུལ་གྱི་གཞོང་པ་ཁ་ཟས་ཀྱིས་བཀང་སྟེ། པུས་མོ་ནུབ་ཙམ་དུ་འབུལ་བར་བགྱིད་དོ། །རིག་སྔགས་འཆང་གིས་བླང་བར་བགྱི་སྟེ།
en: When this number has been reached, a man will emerge halfway from the middle of the fire pit and will present the vidyā holder with a silver dish filled with food, holding it up at the level of the vidyā holder’s thighs.

source: བླངས་པ་ཙམ་གྱིས་ནམ་མཁའ་ལ་འཕུར་བར་འགྱུར་ཞིང་། རིག་སྔགས་འཆང་གི་ལུས་ལ་མེ་འབར་བའི་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: If the vidyā holder takes this dish, he will fly up into the sky, as soon as he grasps it, as bright flames issue from his body.

source: །དེ་འཚལ་ན་ཚེ་ལོ་ཁྲིར་འགྱུར་རོ། །ནམ་མཁའི་རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ།
en: Upon eating the food, his lifespan will extend to ten thousand years, and he will become an emperor of celestial vidyādharas.

source: །བསྐལ་པ་བཅུ་ཚུན་ཆད་ཀྱི་སྔོན་གྱི་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། །དོན་ཡོད་རྒྱལ་པོའི་ཆོ་ག་ཞིབ་མོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་ཁ་ཏོན་དུ་གནས་པར་འགྱུར་རོ།
en: He will recover memories of his former births as far back as ten eons, and this maṇḍala of liberation of the sovereign amogha ritual will remain prominent in his memory. “

source: །གལ་ཏེ་སྣོད་མི་ལེན་ན་དེའི་ཚེ་ཡང་ལན་ཉི་ཤུ་རྩ་གཅིག་སྦྱིན་སྲེག་བགྱིས་ན། ཆེར་གཡོ་བར་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་ཀྱི་མདུན་དུ་མཆིས་ན།
en: If the vidyā holder does not grasp the silver dish but instead offers another twenty-one oblations, the earth will shake violently, and Noble Avalokiteśvara will appear before him in person.

source: རིག་སྔགས་འཆང་ལ་དབུགས་འབྱིན་པར་བགྱིས་ཏེ།
en: He will comfort him by saying, ‘Good!

source: རིག་སྔགས་འཆང་ལེགས་སོ་ལེགས་སོ། །རིག་སྔགས་འཆང་ཁྱོད་ཀྱིས་སྦྱིན་སྲེག་གི་ཆོ་ག་དེ་བསྒྲུབས་ཟིན་གྱིས།
en: It is good, vidyā holder, that you have performed the homa ritual successfully.

source: མཆོག་སློངས་ཤིག་དང་སྦྱིན་ནོ་ཞེས་དེའི་ཚེ་རིག་སྔགས་འཆང་གིས་ཅི་བསམས་པའི་མཆོག་སྨྲས་པ།
en: I will give you whatever you ask for.’
